Revit 2026 API

# AlphanumericRevisionSettings(IListString, String, String) Constructor

---

Initializes a new instance of the AlphanumericRevisionSettings class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AlphanumericRevisionSettings(
	IList<string> sequence,
	string prefix,
	string suffix
)
```
```vb
Public Sub New (
	sequence As IList(Of String),
	prefix As String,
	suffix As String
)
```
```cpp
public:
AlphanumericRevisionSettings(
	IList<String^>^ sequence,
	String^ prefix,
	String^ suffix
)
```
```fsharp
new :
        sequence : IList<string> *
        prefix : string *
        suffix : string -> AlphanumericRevisionSettings
```

#### Parameters

sequence IListString

prefix String

suffix String

#### Reference

AlphanumericRevisionSettings Class

AlphanumericRevisionSettings Overload

Autodesk.Revit.DB Namespace